In [1]:
#Aggregating Data

import pandas as pd

coffee = pd.read_csv("C:/Users/dkvcs/OneDrive/Desktop/data_engineering/01_code/01_1_keith_galli_pd_video/resources/warmup-data/coffee.csv")

bios = pd.read_csv("C:/Users/dkvcs/OneDrive/Desktop/data_engineering/01_code/01_1_keith_galli_pd_video/resources/data/bios.csv")

In [ ]:
bios[bios["born_country"] == "USA"]["born_region"].value_counts()

In [9]:
coffee.insert(3, "Price",7.0 )

In [13]:
coffee.insert(4, "Revenue",10.0 )

In [11]:
# coffee["Units Sold"] = coffee["Units Sold"].interpolate()
# coffee.groupby(["Coffee Type"])["Units Sold"].sum()
coffee.groupby(["Coffee Type"]).agg({
    "Units Sold": "sum", 
    "Price": "mean"
    })

             Units Sold  Price
Coffee Type
Espresso            265    7.0
Latte               195    7.0

In [14]:
pivot = coffee.pivot(columns="Coffee Type", index="Day", values="Revenue")

In [16]:
pivot.loc["Monday", "Latte"]

np.float64(10.0)

In [18]:
pivot.sum(axis=1)

Day
Friday       20.0
Monday       20.0
Saturday     20.0
Sunday       20.0
Thursday     20.0
Tuesday      20.0
Wednesday    20.0
dtype: float64

In [22]:
bios["born_date"] = pd.to_datetime(bios["born_date"])

# bios.groupby(bios["born_date"].dt.year).count()
bios.groupby(bios["born_date"].dt.year)["name"].count().reset_index().sort_values("name", ascending=False)

     born_date  name
139     1972.0  2231
152     1985.0  2227
140     1973.0  2216
138     1971.0  2205
137     1970.0  2174
..         ...   ...
4       1837.0     1
2       1833.0     1
6       1839.0     1
12      1845.0     1
176     2009.0     1

[177 rows x 2 columns]